РазработкаОУМобильная/src/Catalogs/ДрайверыОборудования/ДрайверыОборудования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДрайверыОборудования</name>
  <predefined>
    <items>
      <name>Драйвер1СЭмуляторПлатежнойСистемы</name>
      <description>1C:Эмулятор платежной системы</description>
    </items>
    <items>
      <name>Драйвер1СДрайверFPrint11</name>
      <description>1С:Драйвер FPrint-11</description>
    </items>
    <items>
      <name>Драйвер1СПринтерЧеков</name>
      <description>1С:Принтер чеков</description>
    </items>
    <items>
      <name>Драйвер1СУстройствоВвода</name>
      <description>1С:Устройство ввода</description>
    </items>
    <items>
      <name>ДрайверАТОЛККТ</name>
      <description>АТОЛ:Драйвер ККТ</description>
    </items>
    <items>
      <name>ДрайверInpasПлатежнаяСистема</name>
      <description>ИНПАС:Эквайринг-терминал</description>
    </items>
    <items>
      <name>ДрайверСканкодСканерШтрихкодаChipherlab</name>
      <description>СКАНКОД:Cканер штрихкода Chipherlab</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипОборудования</name>
    <type>
      <types>EnumRef.ТипыПодключаемогоОборудования</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторОбъекта</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>УстановкаИзМакета</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияДрайвера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

РазработкаОУМобильная/src/Catalogs/ДрайверыОборудования/ManagerModule.bsl
Процедура ЗаполнитьПредопределенныйЭлемент(ТипОборудования, ИмяДрайвера, НаименованиеДрайвера, ИдентификаторОбъекта, ВерсияДрайвера = Неопределено, УстановкаИзМакета = Истина) Экспорт
	
	Попытка
		Драйвер = МенеджерОборудованияВызовСервера.ПредопределенныйЭлемент("Справочник.ДрайверыОборудования." + ИмяДрайвера);
	Исключение
		Сообщение = НСтр("ru = 'Предопределенный элемент ""%Параметр%"" не найден.'");
		Сообщение = СтрЗаменить(Сообщение, "%Параметр%", "Справочник.ДрайверыОборудования." + ИмяДрайвера);
		ВызватьИсключение Сообщение;
	КонецПопытки;
		
	Если Драйвер = Неопределено Тогда  
		Драйвер = Справочники.ДрайверыОборудования.СоздатьЭлемент();
		Драйвер.ИмяПредопределенныхДанных = ИмяДрайвера;     
	Иначе 
		Драйвер = Драйвер.ПолучитьОбъект();
	КонецЕсли;
	Драйвер.ТипОборудования      = ТипОборудования;
	Драйвер.Наименование         = НаименованиеДрайвера;
	Драйвер.ИдентификаторОбъекта = ИдентификаторОбъекта;
	Драйвер.ВерсияДрайвера       = ВерсияДрайвера;
	Драйвер.УстановкаИзМакета    = УстановкаИзМакета;
	Драйвер.Записать();
	
КонецПроцедуры
